

# tutorials - crach course redis  

ref : https://www.youtube.com/watch?v=jgpVdJB2sKQ&list=PLtFBvXtDoP-LeZoZ5RoKTi4Gs9jUaWwpA&index=13

## What Is Redis?

key-value storage in RAM   
    - caching data. 

## redis run with docker

- run

docker run -d \
  -e REDIS_PASSWORD=dosimpact\
  -p 7000:6379 \
  --name redis_dev \
  --restart always \
  redis:latest /bin/sh -c 'redis-server --appendonly yes --requirepass ${REDIS_PASSWORD}'

- cli
redis-cli -h 221.153.254.18 -p 27000 -a dosimpact

--- 

## Basic Redis Commands

```

integer > string type 으로 보이고, 안에서는 정수형으로 처리

[ getter/setter Key ]

    set [key] [value] : 데이터를 저장할 때
    get [key]: 저장된 데이터를 검색할 때
    del [key] : 키 삭제
    rename : 저장된 데이터 값을 변경할 때
        rename 1113 1116 : 키 1113을 1116으로 변경

    randomkey : 저장된 key 중에 하나의 key를 랜덤하게 검색할 때
    keys [pattern]: 저장된 모든 key를 검색할 때
        keys * : 모든 키를 검색
        keys *2 : 2로 끝나는 모든 키를 검색

    exists [key] : 검색대상 key가 존재하는지 여부를 확인할 때
        1 이면 존재, 0 이면 없음
    strlen [key] : key에 해당하는 value의 길이
    mset/mget [key] [value] .... : 여러개의 key와 value를 한번에 저장하고 검색할 때
        mset name dodo age 12
        mget name age
        1) "dodo"
        2) "12"
    flushall : 현재 저장되어있는 모든 key 삭제


[ TTL ]

    setex [key] [expiretime(s)] [value]
        set expiretime 의 준말..?
        일정 시간동안만 저장
    ttl [key] : 현재 남은 시간 확인
        setex로 설정하지 않으면 -1임 ( -1 =  no expiration )
        -2는 만료되었음, get 하면 null이 나옴.
    expire [key] 10 : 10초 만료로 설정

    incr [key] (increase value ⇒ default: 1): value가 integer 타입이라면 +1, 아니면 에러
    decr [key] (decrease value ⇒ default: 1): value가 integer 타입이라면 -1, 아니면 에러
    append [key] [append value] : value 에 값 추가
    clear : 화면 클리어
    time : 데이터 저장 시간
    info : redis 서버 설정 상태 조회 명령어

    save
        현재 입력한 key/value 값을 파일로 저장 가능
        config에서 설정하여 자동 저장도 가능
        exit 후 redis-server의 working directory 안에 rdb파일이 생성됨
    > exit #redis-cli를 종료 docker exec -it redis /bin/bash #redis-server shell 접근 > pwd # /mydata > ls appendonly.aof dump.rdb

[ Lists ] 

    lpush,rpush 
        lpush foods apple banana
        (integer) 2
        rpush foods end
        (integer) 4
        
    lrange 
        lrange foods 0 -1
        1) "banana"
        2) "apple"

    lpop, rpop 
        lpop foods
        "melon"
        rpop foods
        "end"

[ Sets ] 

    sadd 
        > sadd hobbies "ba"
        (integer) 1
    smembers 
        > smembers hobbies
        1) "ba"

    srem 
        > srem hobbies "ad"
        (integer) 0

[ Hashes ] 

    smembers 
        > smembers hobbies
        1) "ba"
    hset, hget 
        > hset person name dodo age 12
        (integer) 2
        > hget person name
        "dodo"
        > hget person age
        "12"

    hgetall 
        > hgetall person
        1) "name"
        2) "dodo"
        3) "age"
        4) "12"

    hdel 
        > hdel person age
        (integer) 1

    hexists
        > hexists person age
        (integer) 0
        > hexists person name
        (integer) 1

```
